<a href="https://colab.research.google.com/github/dhir1705/dhir1705/blob/main/Dhiraj_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Practice pandas

In [14]:
import pandas as pd

In [15]:
df = pd.read_csv('/content/Salaries.csv')

In [16]:
df = pd.read_csv("C:\Users\dhira\Desktop\Data science\Python")

SyntaxError: ignored

In [7]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [9]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [8]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

**Attributes do not have parasynthesis**

In [10]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [11]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [14]:
df.shape

(78, 6)

Square Brackets for Shape O for row and 1 for column

In [15]:
df.shape[0]

78

In [16]:
df.shape[1]

6

**Method formula for internal data rows and columns**

**Descriptive statistics of Dataset**

In [18]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [19]:
df.sample(10)

         rank discipline  phd  service     sex  salary
49       Prof          B   17       18  Female  122960
34  AssocProf          B   12        8    Male  119800
45       Prof          B   25       25  Female  140096
51       Prof          B   20       14  Female  127512
56  AssocProf          A   10        8  Female   77500
53   AsstProf          A    5        3  Female   73500
44       Prof          B   23       19  Female  151768
32       Prof          A   27       19    Male  103275
8        Prof          A   29       19    Male   94350
69       Prof          A   28        7  Female  116450

In [ ]:
dir(df)

TypeError: ignored

In [23]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [24]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [26]:
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [32]:
df.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [17]:
df['phd']

0     56
1     12
2     23
3     40
4     20
      ..
73    18
74    19
75    17
76    28
77    23
Name: phd, Length: 78, dtype: int64

In [18]:
df[["phd"]]

    phd
0    56
1    12
2    23
3    40
4    20
..  ...
73   18
74   19
75   17
76   28
77   23

[78 rows x 1 columns]

In [19]:
df_phd = df['phd']

In [20]:
df_phd.columns

AttributeError: ignored

In [21]:
df_phd.size

78

In [22]:
df_phd.dtypes

dtype('int64')

In [23]:
df_phd.count

<bound method Series.count of 0     56
1     12
2     23
3     40
4     20
      ..
73    18
74    19
75    17
76    28
77    23
Name: phd, Length: 78, dtype: int64>

In [24]:
df_phd.describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [25]:
df_phd.mean()

19.705128205128204

In [27]:
df_rank=df.groupby(['rank'])

In [28]:
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [31]:
df.groupby('rank')[['phd','salary']].mean()

                 phd         salary
rank
AssocProf  15.076923   91786.230769
AsstProf    5.052632   81362.789474
Prof       27.065217  123624.804348

In [33]:
df[df['salary']>120000]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
10  Prof          B   39       33    Male  128250
11  Prof          B   23       23    Male  134778
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
29  Prof          B   21       20    Male  123683
31  Prof          B   22       21    Male  155750
35  Prof          B   28       23    Male  126933
36  Prof          B   45       45    Male  146856
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
58  Prof          B   36       26  Female  144651
72  Prof          B   24       15  Female  161101
75  Prof          B   17       17  Female  124312

In [44]:
df[(df['discipline']=='A')& (df['phd']>=20)]

         rank discipline  phd  service     sex  salary
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
5        Prof          A   20       20    Male  122400
6   AssocProf          A   20       17    Male   81285
8        Prof          A   29       19    Male   94350
9        Prof          A   51       51    Male   57800
19       Prof          A   29       27    Male  150500
21       Prof          A   33       30    Male  103106
24       Prof          A   30       23    Male   91100
26       Prof          A   38       19    Male  148750
27       Prof          A   45       43    Male  155865
32       Prof          A   27       19    Male  103275
37       Prof          A   20        8    Male  102000
40       Prof          A   39       36  Female  137000
54  AssocProf          A   25       22  Female   62884
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
69       Prof          A   28        7  Female  116450
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [48]:
df.iloc[:,0:3]

         rank discipline  phd
0        Prof          B   56
1        Prof          A   12
2        Prof          A   23
3        Prof          A   40
4        Prof          B   20
..        ...        ...  ...
73       Prof          B   18
74  AssocProf          B   19
75       Prof          B   17
76       Prof          A   28
77       Prof          A   23

[78 rows x 3 columns]

In [61]:
df.iloc[0:2,: ]

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [60]:
df.iloc[0:50,[2,3,5]]

    phd  service  salary
0    56       49  186960
1    12        6   93000
2    23       20  110515
3    40       31  131205
4    20       18  104800
5    20       20  122400
6    20       17   81285
7    18       18  126300
8    29       19   94350
9    51       51   57800
10   39       33  128250
11   23       23  134778
12    1        0   88000
13   35       33  162200
14   25       19  153750
15   17        3  150480
16    8        3   75044
17    4        0   92000
18   19        7  107300
19   29       27  150500
20    4        4   92000
21   33       30  103106
22    4        2   73000
23    2        0   85000
24   30       23   91100
25   35       31   99418
26   38       19  148750
27   45       43  155865
28    7        2   91300
29   21       20  123683
30    9        7  107008
31   22       21  155750
32   27       19  103275
33   18       18  120000
34   12        8  119800
35   28       23  126933
36   45       45  146856
37   20        8  102000
38    4        3   91000
39   18       18  129000
40   39       36  137000
41   13        8   74830
42    4        2   80225
43    5        0   77000
44   23       19  151768
45   25       25  140096
46   11        3   74692
47   11       11  103613
48   17       17  111512
49   17       18  122960

In [63]:
df[['phd','salary']].agg(['min','max','mean'])

            phd         salary
min    1.000000   57800.000000
max   56.000000  186960.000000
mean  19.705128  108023.782051